In [ ]:
# Filtering DataFrame

- Filtering DataFrame
- Combine multiple Filtering DataFrame
- Filtering not Null value di dalam DataFrame

In [2]:
import pandas as pd

matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':100, 'eca':90})
fisika = pd.Series({'otong':90, 'dinda':70, 'mamat':100, 'eca':70})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':100, 'eca':80})
df = pd.DataFrame({'matematika': matematika, 'fisika': fisika, 'biologi': biologi})

In [3]:
df.head()

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100      100
eca            90      70       80

In [7]:
# ujian matematika di atas 90

# buat terlebih dahulu boolean objek series
matematika_80_atas = df['matematika'] > 80
fisika_80_atas = df['fisika'] > 80

In [6]:
df[matematika_80_atas]

       matematika  fisika  biologi
dinda          90      70       60
mamat         100     100      100
eca            90      70       80

In [8]:
df[fisika_80_atas]

       matematika  fisika  biologi
otong          80      90      100
mamat         100     100      100

In [9]:
# filtering dataframe berdasarkan 2 kondisi, harus diberikan relasi kondisi
## contoh relasi or
df[(matematika_80_atas) | (fisika_80_atas)]

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100      100
eca            90      70       80

In [10]:
## contoh relasi and
df[(matematika_80_atas) & (fisika_80_atas)]

       matematika  fisika  biologi
mamat         100     100      100

In [11]:
# Filtering not Null value di dalam DataFrame
matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':None, 'eca':90})
fisika = pd.Series({'otong':None, 'dinda':70, 'mamat':100, 'eca':70})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':100, 'eca':None})

df2 = pd.DataFrame({'matematika': matematika, 'fisika': fisika, 'biologi': biologi})

In [12]:
df2.head()

       matematika  fisika  biologi
otong        80.0     NaN    100.0
dinda        90.0    70.0     60.0
mamat         NaN   100.0    100.0
eca          90.0    70.0      NaN

In [14]:
# ambil data yang nilainya ada, tidak bernilai null
## buat terlebih dahulu objek boolean series
df2['matematika'].notnull()

otong     True
dinda     True
mamat    False
eca       True
Name: matematika, dtype: bool

In [16]:
df2[df2['matematika'].notnull()]

       matematika  fisika  biologi
otong        80.0     NaN    100.0
dinda        90.0    70.0     60.0
eca          90.0    70.0      NaN

In [17]:
df2[df2['fisika'].notnull()]

       matematika  fisika  biologi
dinda        90.0    70.0     60.0
mamat         NaN   100.0    100.0
eca          90.0    70.0      NaN

In [18]:
# jika ingin mengambil nilai yang bernilai null, bisa seperti ini
df2[df2['fisika'].isnull()]

       matematika  fisika  biologi
otong        80.0     NaN    100.0